УТ_для_edt.РасширениеСмарт/src/Enums/ТипыКонтактнойИнформации/ТипыКонтактнойИнформации.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ТипыКонтактнойИнформации</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>Адрес</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Телефон</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>АдресЭлектроннойПочты</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Skype</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>ВебСтраница</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Факс</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues>
    <name>Другое</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

УТ_для_edt.РасширениеСмарт/src/Catalogs/ФизическиеЛица/ФизическиеЛица.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ФизическиеЛица</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ДатаРождения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Пол</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ИНН</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>12</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ГруппаДоступа</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Уточнение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <tabularSections>
    <name>КонтактнаяИнформация</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>Тип</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Вид</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>500</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЗначенияПолей</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Страна</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Регион</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Город</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>50</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>АдресЭП</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ДоменноеИмяСервера</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефона</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>НомерТелефонаБезКодов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>20</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВидДляСписка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

УТ_для_edt.РасширениеСмарт/src/CommonModules/CRM_МетодыФормСправочниковСервер/Module.bsl
#Область ПеренесеноСДоработкамиСмарт

&ИзменениеИКонтроль("ФизическиеЛицаФормаЭлементаПриСозданииНаСервере")
Процедура смарт_ФизическиеЛицаФормаЭлементаПриСозданииНаСервере(Форма, Объект)

	Если Объект.Ссылка.Пустая() И Форма.Параметры.Свойство("ПараметрыНового") Тогда
		Объект.Наименование = Форма.Параметры.ПараметрыНового.Наименование;

		МассивДопРеквизитов = Форма.КонтактнаяИнформацияОписаниеДополнительныхРеквизитов.НайтиСтроки(Новый Структура("Тип,Вид",Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты,Справочники.ВидыКонтактнойИнформации.EMailФизическиеЛица));
		Если МассивДопРеквизитов.количество() > 0 Тогда
			Форма[МассивДопРеквизитов[0].ИмяРеквизита] = Форма.Параметры.ПараметрыНового.АдресПочты;
		КонецЕсли;
	КонецЕсли;

	// Учесть возможность создания из взаимодействия.
	Если Форма.Параметры.Свойство("Основание")
		И CRM_Взаимодействия.ЕстьРеспондент(Форма.Параметры.Основание) Тогда
		Форма.НеобходимоОповещение = Истина;
		Форма.ОбъектОснование = Форма.Параметры.Основание.Объект;
	КонецЕсли;


	Если Форма.Параметры.Свойство("Основание") И ТипЗнч(Форма.Параметры.Основание) = Тип("ДокументСсылка.ТелефонныйЗвонок") И Объект.Ссылка.Пустая() Тогда
		Форма.НеобходимоОповещение = Истина;
		Форма.ОбъектОснование = Форма.Параметры.Основание;
	КонецЕсли;
	
	#Вставка
	//++ #1644 смарт: Ермаков 19.04.2024 / Изменить доступ к документам физических лиц
	Если Форма.ИмяФормы = "Справочник.ФизическиеЛица.Форма.CRM_МодульУТ_ФормаЭлемента" Тогда
		
		НовыйЭлемнет = Форма.Элементы.Вставить("смартВидФизическогоЛица", Тип("ПолеФормы"),, Форма.Элементы.ГруппаДополнительныеРеквизиты);
		НовыйЭлемнет.ПутьКДанным = "Объект.смартВидФизическогоЛица";
		НовыйЭлемнет.Вид = ВидПоляФормы.ПолеВвода;
		НовыйЭлемнет.ОтображениеПодсказки = ОтображениеПодсказки.Кнопка;
		НовыйЭлемнет.КнопкаОчистки = Истина;
		
		Если Не Пользователи.ЭтоПолноправныйПользователь() Тогда
			НовыйЭлемнет.АвтоОтметкаНезаполненного = Истина; 
		КонецЕсли;
		
	КонецЕсли;
	//-- #1644 смарт: Ермаков 19.04.2024
	#КонецВставки
	
КонецПроцедуры

#КонецОбласти
